# Данные таблицы
TABLE_TITLE = "Перечень норм времени и расценок на работы цеха 188 на 2025 год"

COLUMNS = [
    "Наименование работ с диапазоном объемов (кг)",
    "Норма времени",
    "Расценка",
    "Количество"
]

TABLE_DATA = [
    {
        "name": "10-300 Перемещение, укладка тары эл штабелером",
        "time_norm": 0.28,
        "price": "",
        "quantity": ""
    },
    {
        "name": "50-300 Перемещение по скл кран-балкой",
        "time_norm": 0.34,
        "price": "8+6+10+10",
        "quantity": ""
    },
    {
        "name": "50-450 Погрузка, выгрузка кран-балкой",
        "time_norm": 0.34,
        "price": "24+7+6+36+36",
        "quantity": ""
    },
    {
        "name": "10-300 Погрузка, выгрузка пленки вручную",
        "time_norm": 0.56,
        "price": "40",
        "quantity": ""
    },
    {
        "name": "50-300 Перемещение по скл рохлей",
        "time_norm": 0.28,
        "price": "2+60+660+8+40",
        "quantity": ""
    },
    {
        "name": "50-500 Подъем, перемещение, укладка ПКИ эл штабелером",
        "time_norm": 0.28,
        "price": "110+24+660+110",
        "quantity": ""
    },
    {
        "name": "10-300 Подъем, перемещение, укладка ПКИ тележкой",
        "time_norm": 0.28,
        "price": "",
        "quantity": ""
    },
    {
        "name": "50-300 Выгрузка ПКИ из машины эл. штабелером",
        "time_norm": 0.36,
        "price": "",
        "quantity": ""
    },
    {
        "name": "10-50 Погрузка, выгрузка материалов вручную",
        "time_norm": 0.58,
        "price": "",
        "quantity": ""
    },
    {
        "name": "10-50 Погрузка, выгрузка материалов эл штабелером",
        "time_norm": 0.3,
        "price": "",
        "quantity": ""
    },
    {
        "name": "10-50 Погрузка, выгрузка материалов тележкой",
        "time_norm": 0.36,
        "price": "",
        "quantity": ""
    },
    {
        "name": "50-250 Перемещение материалов тележкой",
        "time_norm": 0.28,
        "price": "",
        "quantity": ""
    },
    {
        "name": "50-250 Перемещение материалов эл штабелером",
        "time_norm": 0.28,
        "price": "",
        "quantity": ""
    },
    {
        "name": "10-50 Перемещение материалов вручную",
        "time_norm": 0.28,
        "price": "",
        "quantity": ""
    },
    {
        "name": "10-200 Выгрузка-погрузка ТМЦ вручную",
        "time_norm": 0.51,
        "price": "24+18+2+150+37",
        "quantity": ""
    },
    {
        "name": "10-100 Укладка ТМЦ вручную",
        "time_norm": 0.42,
        "price": "10+2+32+9+30+9+18+19+45",
        "quantity": ""
    },
    {
        "name": "10-50 Погрузка выгрузка бочек",
        "time_norm": 0.53,
        "price": "3",
        "quantity": ""
    },
    {
        "name": "30-300 Выдача ТМЦ в цех рохлей",
        "time_norm": 0.51,
        "price": "",
        "quantity": ""
    },
    {
        "name": "250-500 Выдача ТМЦ в цех с помощью электроштабелера",
        "time_norm": 0.36,
        "price": "660+8",
        "quantity": ""
    },
    {
        "name": "100-500 Выгрузка-погрузка препрега с помощью рохли",
        "time_norm": 0.30,
        "price": "200+176+150+24",
        "quantity": ""
    },
    {
        "name": "100-500 Перемещение и укладка препрега с помощью рохли",
        "time_norm": 0.28,
        "price": "200+176+376+1764",
        "quantity": ""
    },
    {
        "name": "100-300 Погрузка-выгрузка ящиков БПЛА с помощью крана",
        "time_norm": 0.26,
        "price": "6+40",
        "quantity": ""
    },
    {
        "name": "10-300 Укладка, сортировка и перемещение ящиков БПЛА вручную",
        "time_norm": 0.25,
        "price": "30",
        "quantity": ""
    },
]

FOOTER_NOTE = "Плёнка, стружка, картон (машиной)"
